<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="1,3,400,600" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="x">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="ll.conv1_A.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 3, 1, 1" offset="0" size="96" />
			<output>
				<port id="0" precision="FP16" names="ll.conv1_A.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="ll.conv1_A.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="ll/conv1_A/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_168_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="96" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Reshape_168" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="ll/conv1_A/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv1_A/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="ll.conv2_A.body.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 3, 3" offset="128" size="4608" />
			<output>
				<port id="0" precision="FP16" names="ll.conv2_A.body.0.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="ll.conv2_A.body.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="ll/conv2_A/body/body.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Reshape_183_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="4736" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_183" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="ll/conv2_A/body/body.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv2_A/body/body.0/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="ll/conv2_A/body/body.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ll/conv2_A/body/body.1/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ll.conv2_A.body.2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 3, 3" offset="4768" size="4608" />
			<output>
				<port id="0" precision="FP16" names="ll.conv2_A.body.2.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="ll.conv2_A.body.2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="ll/conv2_A/body/body.2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_199_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="9376" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_199" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="ll/conv2_A/body/body.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv2_A/Mul_output_0,ll/conv2_A/body/body.2/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="ll/conv2_A/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv2_A/Add_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="ll/Relu_5" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ll/Relu_5_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="ll.conv3_A.body.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 3, 3" offset="9408" size="4608" />
			<output>
				<port id="0" precision="FP16" names="ll.conv3_A.body.0.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="ll.conv3_A.body.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="ll/conv3_A/body/body.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_218_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="14016" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_218" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="ll/conv3_A/body/body.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv3_A/body/body.0/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="ll/conv3_A/body/body.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ll/conv3_A/body/body.1/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ll.conv3_A.body.2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 3, 3" offset="14048" size="4608" />
			<output>
				<port id="0" precision="FP16" names="ll.conv3_A.body.2.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="ll.conv3_A.body.2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="ll/conv3_A/body/body.2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_234_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="18656" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_234" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="ll/conv3_A/body/body.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv3_A/Mul_output_0,ll/conv3_A/body/body.2/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="ll/conv3_A/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv3_A/Add_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="ll.conv4_A.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 16, 1, 1" offset="18688" size="96" />
			<output>
				<port id="0" precision="FP16" names="ll.conv4_A.weight">
					<dim>3</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="ll.conv4_A.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="ll/conv4_A/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_252_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="18784" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_252" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="ll/conv4_A/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv4_A/Conv_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="ll/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Sub_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_51" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18790" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="ll/ReduceMax" type="ReduceMax" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/ReduceMax_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_53" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18790" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="ll/ReduceMin" type="ReduceMin" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/ReduceMin_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="ll/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18798" size="8" />
			<output>
				<port id="0" precision="I64" names="ll/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="48" name="Constant_56" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18790" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="49" name="ll/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="ll/Gather_output_0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_1839_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="18806" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_1839" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="ll/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Mul_output_0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="ll/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18790" size="8" />
			<output>
				<port id="0" precision="I64" names="ll/Constant_output_0" />
			</output>
		</layer>
		<layer id="54" name="Constant_59" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18790" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="55" name="ll/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="ll/Gather_1_output_0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_1840_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="18808" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_1840" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="ll/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Mul_1_output_0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="ll/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Add_output_0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="ll/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18810" size="8" />
			<output>
				<port id="0" precision="I64" names="ll/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="61" name="Constant_61" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18790" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="62" name="ll/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="ll/Gather_2_output_0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_1841_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="18818" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_1841" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="ll/Mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Mul_2_output_0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="ll/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Add_1_output_0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="ll/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18790" size="8" />
			<output>
				<port id="0" precision="I64" names="ll/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="ll/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="ll/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="ll/Concat_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="ll.conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 3, 1, 1" offset="18820" size="18" />
			<output>
				<port id="0" precision="FP16" names="ll.conv1.weight">
					<dim>3</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="ll.conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="ll/conv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Reshape_85_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="18838" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_85" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="ll/conv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv1/Conv_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="ll/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ll/Relu_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="ll.conv2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 3, 3, 3" offset="18844" size="162" />
			<output>
				<port id="0" precision="FP16" names="ll.conv2.weight">
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="ll.conv2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="ll/conv2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_101_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="19006" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Reshape_101" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="ll/conv2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv2/Conv_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="ll/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ll/Relu_1_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="ll/Concat_1" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Concat_1_output_0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="ll.conv3.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 6, 5, 5" offset="19012" size="900" />
			<output>
				<port id="0" precision="FP16" names="ll.conv3.weight">
					<dim>3</dim>
					<dim>6</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="ll.conv3.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>6</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>6</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="ll/conv3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>6</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_118_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="19912" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_118" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="ll/conv3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv3/Conv_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="ll/Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ll/Relu_2_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="ll/Concat_2" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Concat_2_output_0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="ll.conv4.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 6, 7, 7" offset="19918" size="1764" />
			<output>
				<port id="0" precision="FP16" names="ll.conv4.weight">
					<dim>3</dim>
					<dim>6</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="ll.conv4.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>6</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>6</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="ll/conv4/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>6</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_135_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="21682" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Reshape_135" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="ll/conv4/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv4/Conv_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="ll/Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ll/Relu_3_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="ll/Concat_3" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="ll/Concat_3_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="ll.conv5.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="21688" size="24" />
			<output>
				<port id="0" precision="FP16" names="ll.conv5.weight">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="ll.conv5.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="ll/conv5/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Reshape_152_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="21712" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Reshape_152" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="ll/conv5/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/conv5/Conv_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="ll/Relu_4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ll/Relu_4_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="ll/Mul_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Mul_3_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="ll/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ll/Add_2_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="ll/Clip" type="Clamp" version="opset1">
			<data min="9.9999997171806854e-10" max="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ll/Clip_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
